{"ast":null,"code":"import * as i0 from \"@angular/core\";\nexport let ProductService = /*#__PURE__*/(() => {\n  class ProductService {\n    constructor() {\n      this.products = [{\n        id: 1,\n        name: \"VenkateswaraSwamy\",\n        img: \"p1.jpg\",\n        content: \"Sri Venkateswara Swami Vaari Temple is a Hindu temple situated in the hill town of Tirumala at Tirupati in Tirupati district of Andhra Pradesh, India. The Temple is dedicated to Venkateswara, a form of Vishnu, who is believed to have appeared on the earth to save mankind from trials and troubles of Kali Yuga.\",\n        price: 5000,\n        cart: \"AddToCart\"\n      }, {\n        id: 2,\n        name: \"Saibaba\",\n        img: \"p2.jpg\",\n        content: \"It is dedicated to the Indian saint Sai Baba of Shirdi. The temple was built in 1952 by one B V Narasimhaswami, a Salem and Sai Baba devotee, out of money donated by a Chettiar merchant. This is considered the most trusted temple in India. The temple is the headquarters of the All India Sai Samaj.\",\n        price: 5000,\n        cart: \"AddToCart\"\n      }, {\n        id: 3,\n        name: \"AnanthaPadmanabhaSwamy\",\n        img: \"p3.jpg\",\n        content: \"The Sree Padmanabhaswamy Temple is renowned for its beauty and grandeur. Dedicated to LordVishnu, it is one of the 108 sacred Vishnu temples or 'Divya Deshams' in India. The great King of Travancore, Marthanda Varma is said to have done the renovation work that we see today.\",\n        price: 5000,\n        cart: \"AddToCart\"\n      }, {\n        id: 4,\n        name: \"Badrinath Temple\",\n        img: \"p5.jfif\",\n        content: \"Dedicated to Lord Vishnu, the Badrinath Temple is one of the most important pilgrimage sites in India. It is among the four holy places or char dham, which are much revered by Hindus. Devotees undertake a strenuous journey through the mighty Himalayas to reach this holy shrine.\",\n        price: 5000,\n        cart: \"AddToCart\"\n      }, {\n        id: 5,\n        name: \"kashivishwanath temple.\",\n        img: \"p6.jpg\",\n        content: \"The temple has been destroyed by invading forces and rebuilt three times. The current temple is built directly next to a mosque which is built on the ruins of an earlier version of Vishwanath. Both sides have filed charges seeking to determine who has the right to the property in the area.\",\n        price: 5000,\n        cart: \"AddToCart\"\n      }, {\n        id: 6,\n        name: \"KanakaDurgamma\",\n        img: \"p4.jpg\",\n        content: \"As per his wishes of killing the demons, Goddess Durga made Indrakila Her permanent abode. Later, She also slayed the demon king Mahishasura freeing the people of Vijayawada from evil. At the Kanakadurga temple, the enchanting 4-foot-high (1.2 m) icon of the deity is bedecked in glittering ornaments and bright flowers.\",\n        price: 5000,\n        cart: \"AddToCart\"\n      }];\n    }\n    getProduct() {\n      return this.products;\n    }\n  }\n  ProductService.ɵfac = function ProductService_Factory(t) {\n    return new (t || ProductService)();\n  };\n  ProductService.ɵprov = /*@__PURE__*/i0.ɵɵdefineInjectable({\n    token: ProductService,\n    factory: ProductService.ɵfac,\n    providedIn: 'root'\n  });\n  return ProductService;\n})();","map":null,"metadata":{},"sourceType":"module","externalDependencies":[]}